{
  "ubuntu": {
    "distroName": "Ubuntu",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<0>Για να εγκαταστήσετε το Flatpak σε <strong>Ubuntu 18.10 (Cosmic Cuttlefish) ή νεότερη έκδοση</strong>, ανοίξτε την εφαρμογή Terminal και εκτελέστε:</0> <2></2>"
    },
    "step-2": {
      "name": "Εγκατάσταση του πρόσθετου λογισμικού GNOME Flatpak",
      "text": "<p>Το πρόσθετο GNOME Software καθιστά δυνατή την εγκατάσταση εφαρμογών χωρίς να χρειάζεται η γραμμή εντολών. Για να το εγκαταστήσετε, εκτελέστε:</p> <2></2> <4><strong>Σημείωση:</strong> Το Ubuntu διανέμει το GNOME Software ως Snap στις εκδόσεις 20.04 έως 23.04 και το αντικατέστησε με το App Center στην 23.10 και νεότερες εκδόσεις - καμία από τις οποίες δεν υποστηρίζει την εγκατάσταση εφαρμογών Flatpak. Η εγκατάσταση του πρόσθετου Flatpak θα εγκαταστήσει επίσης μια deb έκδοση του Λογισμικού GNOME, με αποτέλεσμα να εγκατασταθούν ταυτόχρονα δύο εφαρμογές «Λογισμικό» στο Ubuntu 20.04 έως 23.04 και μια ενιαία νέα εφαρμογή «Λογισμικό» στο Ubuntu 23.10 και νεότερες.</4>"
    },
    "step-3": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<p>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, εκτελέστε:</p> <2></2>"
    },
    "step-4": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>"
    }
  },
  "fedora": {
    "distroName": "Fedora",
    "introduction": "<0>Το Flatpak είναι εγκατεστημένο από προεπιλογή στα Fedora Workstation, Fedora Silverblue και Fedora Kinoite. Για να ξεκινήσετε, το μόνο που χρειάζεται να κάνετε είναι να ενεργοποιήσετε το Flathub, το οποίο είναι ο καλύτερος τρόπος για να αποκτήσετε εφαρμογές Flatpak. Το Flathub είναι προ-ρυθμισμένο ως μέρος των <2>Third-Party Repositories</2>. Εναλλακτικά, μπορείτε να κατεβάσετε και να εγκαταστήσετε το <5>αρχείο αποθετηρίου Flathub</5>.</0> <2>Τώρα το μόνο που έχετε να κάνετε είναι <2>εγκατάσταση εφαρμογών</2>!</2> <p>Οι παραπάνω σύνδεσμοι θα πρέπει να λειτουργούν στις προεπιλεγμένες εγκαταστάσεις GNOME και KDE του Fedora, αλλά αν αποτύχουν για κάποιο λόγο, μπορείτε να προσθέσετε χειροκίνητα το απομακρυσμένο Flathub εκτελώντας:</p> <6></6>"
  },
  "manjaro": {
    "distroName": "Μαντζάρο",
    "step-1": {
      "name": "Ενεργοποίηση του Flatpak μέσω του Software Manager",
      "text": "<p>Το Flatpak εγκαθίσταται από προεπιλογή στο Manjaro 20 ή νεότερη έκδοση. </p> <2>Για να ενεργοποιήσετε την υποστήριξή του, πλοηγηθείτε στη <strong>Διαχείριση Λογισμικού</strong> (Προσθήκη/Αφαίρεση Προγραμμάτων)</2> <p> <p>Κάντε κλικ στο μενού με τις τρεις γραμμές [ή τις τελείες ανάλογα με το περιβάλλον επιφάνειας εργασίας] στα δεξιά, στο αναπτυσσόμενο μενού επιλέξτε «Προτιμήσεις»</p> <p>Πλοηγηθείτε στην καρτέλα «Flatpak» και σύρετε το διακόπτη στο Enable Flatpak support (είναι επίσης δυνατό να ενεργοποιήσετε τον έλεγχο για ενημερώσεις, κάτι που συνιστάται).</p>"
    },
    "step-2": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>"
    }
  },
  "endless_os": {
    "distroName": "Ατελείωτο OS",
    "introduction": "<0>Η υποστήριξη Flatpak είναι ενσωματωμένη στο Endless OS 3.0.0 και νεότερα - δεν απαιτείται εγκατάσταση!</0>"
  },
  "alt_linux": {
    "distroName": "ALT Linux",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Για να εγκαταστήσετε το Flatpak σε λειτουργικά συστήματα της οικογένειας Alt, ανοίξτε την εφαρμογή Terminal και εκτελέστε:</p> <2></2>"
    },
    "step-2": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<p>Το Flathub είναι ένα εξαιρετικό μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε στο σύστημα Alt, εκτελέστε:</p> <2></2>"
    },
    "step-3": {
      "name": "Επανεκκίνηση",
      "text": "<0>Επανεκκινήστε τη συσκευή σας για να ολοκληρώσετε την εγκατάσταση του Flatpak. Τώρα μπορείτε να <1>εγκαταστήσετε εφαρμογές</1>!</0>"
    }
  },
  "chrome_os": {
    "distroName": "ChromeOS",
    "introduction": "<0>Οι εφαρμογές Flatpak μπορούν να εγκατασταθούν στο ChromeOS με το επίπεδο συμβατότητας Crostini Linux. Αυτό δεν είναι διαθέσιμο για όλες τις συσκευές ChromeOS, οπότε θα πρέπει να βεβαιωθείτε ότι η συσκευή σας είναι συμβατή πριν προχωρήσετε. Ένας κατάλογος συμβατών συσκευών διατηρείται <2>εδώ</2>.</0>",
    "step-1": {
      "name": "Ενεργοποίηση υποστήριξης Linux",
      "text": "<0>Πλοηγηθείτε στο <2>chrome://os-settings</2> και μετακινηθείτε προς τα κάτω στο <strong>Developers</strong>. και ενεργοποιήστε το <i>Περιβάλλον ανάπτυξης Linux</i>. Το ChromeOS θα χρειαστεί λίγο χρόνο για να κατεβάσει και να εγκαταστήσει το Linux.</0>"
    },
    "step-2": {
      "name": "Ξεκινήστε ένα τερματικό Linux",
      "text": "<p>Πιέστε το πλήκτρο αναζήτησης/εκκίνησης, πληκτρολογήστε «Terminal» και εκκινήστε την εφαρμογή Terminal.</p>"
    },
    "step-3": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Για να εγκαταστήσετε το Flatpak, εκτελέστε τα ακόλουθα στο τερματικό:</p> <2></2>"
    },
    "step-4": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<p>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, εκτελέστε:</p> <2></2>"
    },
    "step-5": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το Linux. Μπορείτε να το κάνετε αυτό κάνοντας δεξί κλικ στο τερματικό και στη συνέχεια επιλέγοντας «Shut down Linux». Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>"
    }
  },
  "red_hat_enterprise_linux": {
    "distroName": "Red Hat Enterprise Linux",
    "introduction": "<0>Το Flatpak εγκαθίσταται από προεπιλογή στο Red Hat Enterprise Linux Workstation 9 και νεότερα. Για να ξεκινήσετε, το μόνο που χρειάζεται να κάνετε είναι να ενεργοποιήσετε το Flathub, το οποίο είναι ο καλύτερος τρόπος για να αποκτήσετε εφαρμογές Flatpak. Απλά κατεβάστε και εγκαταστήστε το αρχείο <2>Flathub repository</2>.</0> <p>Για να εγκαταστήσετε το Flatpak στο Red Hat Enterprise Linux Workstation 8 ή παλαιότερα, εκτελέστε τα ακόλουθα σε ένα τερματικό:</p> <5></5> <7>Τώρα το μόνο που έχετε να κάνετε είναι <2>εγκατάσταση εφαρμογών</2>!</7> <p>Οι παραπάνω σύνδεσμοι θα πρέπει να λειτουργούν στην προεπιλεγμένη εγκατάσταση του Red Hat Enterprise Linux Workstation 9, αλλά αν αποτύχουν για κάποιο λόγο, μπορείτε να προσθέσετε χειροκίνητα το απομακρυσμένο Flathub εκτελώντας:</p> <11></11>"
  },
  "linux_mint": {
    "distroName": "Linux Mint",
    "introduction": "<0>Η υποστήριξη Flatpak είναι ενσωματωμένη στο Linux Mint 18.3 και νεότερες εκδόσεις - δεν απαιτείται εγκατάσταση!</0>"
  },
  "opensuse": {
    "distroName": "openSUSE",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Το Flatpak είναι διαθέσιμο στα προεπιλεγμένα αποθετήρια όλων των εκδόσεων openSUSE Leap και openSUSE Tumbleweed που συντηρούνται επί του παρόντος.</p> <2>Αν προτιμάτε μια γραφική εγκατάσταση, μπορείτε να εγκαταστήσετε το Flatpak χρησιμοποιώντας ένα «πρόγραμμα εγκατάστασης με 1 κλικ» από το <2>software.opensuse.org</2>. Αν η έκδοση της διανομής σας δεν εμφανίζεται από προεπιλογή, κάντε κλικ στο <5>Εμφάνιση</5> στην κατηγορία Μη υποστηριζόμενες διανομές και στη συνέχεια επιλέξτε από τη λίστα.</2> <p>Εναλλακτικά, εγκαταστήστε το Flatpak από τη γραμμή εντολών χρησιμοποιώντας το Zypper:</p> <6></6>"
    },
    "step-2": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<p>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, εκτελέστε:</p> <2></2>"
    },
    "step-3": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>"
    }
  },
  "arch": {
    "distroName": "Arch",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Για να εγκαταστήσετε το Flatpak στο Arch, ανοίξτε την εφαρμογή Terminal και εκτελέστε:</p> <2></2>"
    },
    "step-2": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>"
    }
  },
  "debian": {
    "distroName": "Debian",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Ένα πακέτο flatpak είναι διαθέσιμο στο Debian 10 (Buster) και νεότερα. Για να το εγκαταστήσετε, εκτελέστε τα ακόλουθα ως διαχειριστής συστήματος:</p> <2></2>"
    },
    "step-2": {
      "name": "Εγκαταστήστε το πρόσθετο Software Flatpak",
      "text": "<p>Αν χρησιμοποιείτε το GNOME, είναι επίσης καλή ιδέα να εγκαταστήσετε το πρόσθετο Flatpak για το λογισμικό GNOME. Για να το κάνετε αυτό, εκτελέστε:</p> <2></2> <p>Εάν εκτελείτε KDE, θα πρέπει αντ' αυτού να εγκαταστήσετε το backend Flatpak του Plasma Discover:</p> <6></6>"
    },
    "step-3": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<0>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, κατεβάστε και εγκαταστήστε το αρχείο αποθετηρίου <2>Flathub</2> ή εκτελέστε τα ακόλουθα σε ένα τερματικό:</0> <2></2>"
    },
    "step-4": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>"
    }
  },
  "rocky_linux": {
    "distroName": "Rocky Linux",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Το Flatpak εγκαθίσταται από προεπιλογή στο Rocky Linux 8 και νεότερα, όταν εγκαθίσταται με μια επιλογή λογισμικού που περιλαμβάνει το GNOME (Server με GUI, Workstation). Εάν χρησιμοποιείτε ένα τέτοιο σύστημα, μπορείτε να παραλείψετε αυτό το βήμα. Για να εγκαταστήσετε το Flatpak στο Rocky Linux, εκτελέστε τα ακόλουθα σε ένα τερματικό:</p> <2></2>"
    },
    "step-2": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<0>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, κατεβάστε και εγκαταστήστε το αρχείο αποθετηρίου <2>Flathub</2> ή εκτελέστε τα παρακάτω σε ένα τερματικό:</0> <2></2>"
    },
    "step-3": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>"
    }
  },
  "centos": {
    "introduction": "<0>Το Flatpak εγκαθίσταται από προεπιλογή στο CentOS 7 και νεότερες εκδόσεις, όταν χρησιμοποιείται το GNOME. Για να ξεκινήσετε, το μόνο που χρειάζεται να κάνετε είναι να ενεργοποιήσετε το Flathub, το οποίο είναι ο καλύτερος τρόπος για να αποκτήσετε εφαρμογές Flatpak. Απλά κατεβάστε και εγκαταστήστε το αρχείο του <2>Flathub repository</2>.</0> <2>Τώρα το μόνο που έχετε να κάνετε είναι <2>εγκατάσταση εφαρμογών</2>!</2>",
    "distroName": "CentOS"
  },
  "almalinux": {
    "distroName": "AlmaLinux",
    "introduction": "<0>Το Flatpak εγκαθίσταται από προεπιλογή στο AlmaLinux 8 και νεότερα, όταν χρησιμοποιείτε το GNOME. Για να ξεκινήσετε, το μόνο που χρειάζεται να κάνετε είναι να ενεργοποιήσετε το Flathub, το οποίο είναι ο καλύτερος τρόπος για να αποκτήσετε εφαρμογές Flatpak. Απλά κατεβάστε και εγκαταστήστε το αρχείο <2>Flathub repository</2>.</0> <2>Τώρα το μόνο που έχετε να κάνετε είναι <2>εγκατάσταση εφαρμογών</2>!</2>"
  },
  "gentoo": {
    "distroName": "Gentoo",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Για να εγκαταστήσετε το Flatpak στο Gentoo, ανοίξτε την εφαρμογή Terminal και εκτελέστε:</p> <2></2>"
    },
    "step-2": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<p>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, εκτελέστε:</p> <2></2>"
    },
    "step-3": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι <2>εγκατάσταση εφαρμογών</2>!</0> <p>Σημείωση: η γραφική εγκατάσταση των εφαρμογών Flatpak μπορεί να μην είναι δυνατή με το Gentoo.</p>"
    }
  },
  "kubuntu": {
    "distroName": "Kubuntu",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Για να εγκαταστήσετε το Flatpak στο Kubuntu, ανοίξτε το Discover, πηγαίνετε στις Ρυθμίσεις, εγκαταστήστε το Flatpak backend και επανεκκινήστε το Discover.</p>"
    },
    "step-2": {
      "name": "Εγκαταστήστε το πρόσθετο ρυθμίσεων συστήματος Flatpak",
      "text": "<p>Για να ενσωματώσετε την υποστήριξη Flatpak στις Ρυθμίσεις συστήματος Plasma, ανοίξτε την εφαρμογή Terminal και εκτελέστε:</p> <2></2>"
    },
    "step-3": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<p>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, ανοίξτε το Discover, μεταβείτε στις Ρυθμίσεις και προσθέστε το αποθετήριο Flathub.</p>"
    },
    "step-4": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>"
    }
  },
  "solus": {
    "distroName": "Solus",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Για να εγκαταστήσετε το Flatpak στο Solus, ανοίξτε την εφαρμογή Terminal και εκτελέστε:</p> <2></2>"
    },
    "step-2": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<0>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, κατεβάστε και εγκαταστήστε το αρχείο αποθετηρίου <2>Flathub</2> ή εκτελέστε τα παρακάτω σε ένα τερματικό:</0> <2></2>"
    },
    "step-3": {
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι <2>εγκατάσταση εφαρμογών</2>!</0> <p>Σημείωση: η γραφική εγκατάσταση των εφαρμογών Flatpak είναι διαθέσιμη μόνο μέσω του λογισμικού GNOME και/ή του KDE Discover.</p>",
      "name": "Επανεκκίνηση"
    },
    "introduction": "<p>Η υποστήριξη Flatpak είναι ενσωματωμένη στο Solus 4.7 και νεότερες εκδόσεις - δεν απαιτείται εγκατάσταση! Οι εφαρμογές Flatpak μπορούν να εγκατασταθούν χρησιμοποιώντας το λογισμικό GNOME και/ή το KDE Discover.</p> <p>Αν το Flatpak δεν είναι εγκατεστημένο, ακολουθήστε τις παρακάτω οδηγίες για να ξεκινήσετε.</p>"
  },
  "alpine": {
    "distroName": "Αλπικό",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Το Flatpak μπορεί να εγκατασταθεί από το κοινοτικό αποθετήριο. Εκτελέστε τα ακόλουθα σε ένα τερματικό:</p> <2></2>"
    },
    "step-2": {
      "name": "Εγκαταστήστε το πρόσθετο Software Flatpak",
      "text": "<p>Μπορείτε να εγκαταστήσετε το πρόσθετο Flatpak είτε για το λογισμικό GNOME (από την έκδοση v3.13) είτε για το KDE Discover (από την έκδοση v3.11), καθιστώντας δυνατή την εγκατάσταση εφαρμογών χωρίς να χρειάζεστε τη γραμμή εντολών. Για να εγκαταστήσετε, για το GNOME Software εκτελέστε:</p> <2></2> <p>Για το KDE Discover εκτελέστε:</p> <6></6>"
    },
    "step-3": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<0>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, κατεβάστε και εγκαταστήστε το αρχείο αποθετηρίου <2>Flathub</2> ή εκτελέστε τα παρακάτω σε ένα τερματικό:</0> <2></2>"
    },
    "step-4": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι <1>εγκατάσταση εφαρμογών</1>!</0>"
    }
  },
  "mageia": {
    "distroName": "Μαγεία",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Ένα πακέτο flatpak είναι διαθέσιμο για το Μαγεία 6 και νεότερες εκδόσεις. Για να εγκαταστήσετε με DNF, εκτελέστε τα ακόλουθα ως διαχειριστής:</p> <2></2> <4>Ή, για να εγκαταστήσετε με <1>urpmi</1>, εκτελέστε:</4> <6></6>"
    },
    "step-2": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<0>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, κατεβάστε και εγκαταστήστε το αρχείο αποθετηρίου <2>Flathub</2> ή εκτελέστε τα παρακάτω σε ένα τερματικό:</0> <2></2>"
    },
    "step-3": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε τις εφαρμογές</2>!</0> <p>Σημείωση: η γραφική εγκατάσταση των εφαρμογών Flatpak μπορεί να μην είναι δυνατή με το Μαγεία.</p>"
    }
  },
  "openmandriva_lx": {
    "distroName": "OpenMandriva Lx",
    "introduction": "<0>Η υποστήριξη Flatpak είναι ενσωματωμένη στο OpenMandriva για όλες τις ενεργά υποστηριζόμενες εκδόσεις, ξεκινώντας από τη σταθερή/διορθωμένη έκδοση 'Rock 5.0', μέσω της έκδοσης ανάπτυξης 'Cooker', και καταλήγοντας στην κυλιόμενη έκδοση 'ROME'.</0> <p>Το Flatpak έρχεται με το προ-ρυθμισμένο αποθετήριο Flathub.</p>"
  },
  "pop_os": {
    "distroName": "Pop!_OS",
    "introduction": "<0>Η υποστήριξη Flatpak είναι ενσωματωμένη στο Pop!_OS 20.04 και νεότερες εκδόσεις - δεν απαιτείται εγκατάσταση!</0>"
  },
  "elementary_os": {
    "distroName": "στοιχειώδες OS",
    "step-1": {
      "name": "Εγκατάσταση εφαρμογών",
      "text": "<0>Το στοιχειώδες λειτουργικό σύστημα 5.1 και νεότερα διαθέτει υποστήριξη Flatpak από το κουτί. Για μη επιμελημένες εφαρμογές, κατευθυνθείτε στο <2>Flathub</2> για να εγκαταστήσετε οποιαδήποτε εφαρμογή χρησιμοποιώντας το μεγάλο κουμπί «Install» και ανοίξτε το αρχείο `.flatpakref` που κατεβάσατε με το Sideload.</0> <p>Σημείωση: Μετά την εγκατάσταση μιας εφαρμογής από ένα απομακρυσμένο σύστημα όπως το Flathub, όλες οι άλλες εφαρμογές από αυτό το απομακρυσμένο σύστημα θα εμφανιστούν αυτόματα και στο AppCenter.</p>"
    }
  },
  "raspberry_pi_os": {
    "distroName": "Raspberry Pi OS",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Ένα πακέτο flatpak είναι διαθέσιμο στο Raspberry Pi OS (που προηγουμένως ονομαζόταν Raspbian) Stretch και νεότερα. Για να το εγκαταστήσετε, εκτελέστε τα ακόλουθα ως διαχειριστής συστήματος:</p> <2></2>"
    },
    "step-2": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<p>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, εκτελέστε:</p> <2></2> <4><0>Σημαντική σημείωση:</0> Συνιστάται η χρήση του Raspberry Pi OS 64-bit, καθώς οι νεότερες εφαρμογές είναι πιο πιθανό να είναι διαθέσιμες μόνο για αυτή την πλατφόρμα.</4>"
    },
    "step-3": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι <2>εγκατάσταση εφαρμογών</2>!</0> <p>Σημείωση: η γραφική εγκατάσταση των εφαρμογών Flatpak μπορεί να μην είναι δυνατή με το Raspberry Pi OS.</p>"
    }
  },
  "clear_linux": {
    "distroName": "Clear Linux",
    "introduction": "<p>Το Flatpak είναι εγκατεστημένο και το αποθετήριο Flathub είναι προκαθορισμένο από προεπιλογή στο Clear Linux κατά την εγκατάσταση του πακέτου επιφάνειας εργασίας.</p> <2></2> <4>Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</4>"
  },
  "void_linux": {
    "distroName": "Void Linux",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Για να εγκαταστήσετε το Flatpak στο Void Linux, εκτελέστε τα ακόλουθα σε ένα τερματικό:</p> <2></2>"
    },
    "step-2": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<p>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, εκτελέστε:</p> <2></2>"
    },
    "step-3": {
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>",
      "name": "Επανεκκίνηση"
    }
  },
  "nixos": {
    "distroName": "NixOS",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<0>Για να εγκαταστήσετε το Flatpak, ορίστε την επιλογή του NixOS <2>services.flatpak.enable</2> σε <4>true</4> βάζοντας τα ακόλουθα στο <7>/etc/nixos/configuration.nix</7>:</0> <2></2> <p>Στη συνέχεια, ανακατασκευάστε και μεταβείτε στη νέα διαμόρφωση με:</p> <6></6> <8>Για περισσότερες λεπτομέρειες δείτε την τεκμηρίωση του <2>NixOS</2>.</8>"
    },
    "step-2": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<p>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, εκτελέστε:</p> <2></2>"
    },
    "step-3": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>"
    }
  },
  "pureos": {
    "distroName": "PureOS",
    "introduction": "<0>Το Flatpak είναι εγκατεστημένο από προεπιλογή στο PureOS. Για να ξεκινήσετε, το μόνο που χρειάζεται να κάνετε είναι να ενεργοποιήσετε το Flathub, το οποίο είναι ο καλύτερος τρόπος για να αποκτήσετε εφαρμογές Flatpak. Απλά κατεβάστε και εγκαταστήστε το αρχείο <2>Flathub repository</2>.</0> <2>Τώρα το μόνο που έχετε να κάνετε είναι <2>εγκατάσταση εφαρμογών</2>!</2>"
  },
  "zorin_os": {
    "introduction": "<0>Η υποστήριξη Flatpak είναι ενσωματωμένη στο Zorin OS</0> <p>Μπορείτε να χρησιμοποιήσετε την εφαρμογή Software Store για να κατεβάσετε εφαρμογές Flatpak.</p>",
    "distroName": "Zorin OS"
  },
  "deepin": {
    "distroName": "Deepin",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Για να εγκαταστήσετε το Flatpak στο Deepin, εκτελέστε τα ακόλουθα σε ένα τερματικό:</p> <2></2>"
    },
    "step-2": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<p>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, εκτελέστε:</p> <2></2>"
    },
    "step-3": {
      "name": "Εγκαταστήστε τα θέματα Deepin",
      "text": "<p>Για να εγκαταστήσετε ανοιχτά και σκούρα θέματα, εκτελέστε:</p> <2></2>"
    },
    "step-4": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>"
    }
  },
  "pardus": {
    "distroName": "Pardus",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Ένα πακέτο flatpak είναι διαθέσιμο στο Pardus 2019 και σε νεότερες εκδόσεις. Για να το εγκαταστήσετε, εκτελέστε τα ακόλουθα ως διαχειριστής συστήματος:</p> <2></2>"
    },
    "step-2": {
      "name": "Εγκαταστήστε το πρόσθετο Software Flatpak",
      "text": "<p>Αν χρησιμοποιείτε το GNOME, είναι επίσης καλή ιδέα να εγκαταστήσετε το πρόσθετο Flatpak για το λογισμικό GNOME. Για να το κάνετε αυτό, εκτελέστε:</p> <2></2>"
    },
    "step-3": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<p>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, εκτελέστε:</p> <2></2>"
    },
    "step-4": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>"
    }
  },
  "mx_linux": {
    "distroName": "MX Linux",
    "step-1": {
      "name": "Ενεργοποίηση του Flatpak μέσω του Software Manager",
      "text": "Η υποστήριξη του <p>Flatpak κατασκευάζεται από το MX 18 και αργότερα. Χρειάζεται μόνο να ενεργοποιήσετε το αποθετήριο Flathub μετά από αυτές τις οδηγίες:</p> <2> Open <strong>MX Package Installer</strong> (ανοιχτό το μενού και κοιτάξτε στα MX Tools), επιλέξτε την καρτέλα \"Flatpaks\", για να ενεργοποιήσετε το αποθετήριο που θα πρέπει να εισάγετε τον κωδικό βάσης.</2>"
    },
    "step-2": {
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>",
      "name": "Επανεκκίνηση"
    }
  },
  "pisi_gnulinux": {
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Ένα πακέτο flatpak είναι διαθέσιμο στο Pisi 2.1 και νεότερα. Για να το εγκαταστήσετε, εκτελέστε τα ακόλουθα ως διαχειριστής συστήματος:</p> <2></2>"
    },
    "step-2": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<p>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, εκτελέστε:</p> <2></2>"
    },
    "step-3": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι <2>εγκατάσταση εφαρμογών</2>!</0> <p>Σημείωση: η γραφική εγκατάσταση των εφαρμογών Flatpak μπορεί να μην είναι δυνατή με το Pisi GNU/Linux.</p>"
    },
    "distroName": "Pisi GNU/Linux"
  },
  "endeavouros": {
    "distroName": "EndeavourOS",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Για να εγκαταστήσετε το Flatpak στο EndeavorOS, πρέπει πρώτα να βεβαιωθείτε ότι η εγκατάστασή σας είναι ενημερωμένη, εκτελέστε τα ακόλουθα σε ένα τερματικό:</p> <2></2> <p>Στη συνέχεια εγκαταστήστε το Flatpak:</p> <6></6>"
    },
    "step-2": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<p>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, εκτελέστε:</p> <2></2>"
    },
    "step-3": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι <2>εγκατάσταση εφαρμογών</2>!</0> <p>Σημείωση: η γραφική εγκατάσταση των εφαρμογών Flatpak μπορεί να μην είναι δυνατή με το EndeavourOS.</p>"
    }
  },
  "kde_neon": {
    "distroName": "KDE νέον",
    "introduction": "<0>Η υποστήριξη Flatpak είναι ενσωματωμένη στο KDE νέον 19 και νεότερα - δεν απαιτείται εγκατάσταση!</0>"
  },
  "gnu_guix": {
    "distroName": "GNU Guix",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Για να εγκαταστήσετε το Flatpak στο GNU Guix, εκτελέστε τα ακόλουθα σε ένα τερματικό:</p> <2></2>"
    },
    "step-2": {
      "text": "<p>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, εκτελέστε:</p> <2></2>",
      "name": "Προσθέστε το αποθετήριο Flathub"
    },
    "step-3": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι <2>εγκατάσταση εφαρμογών</2>!</0> <p>Σημείωση: η γραφική εγκατάσταση των εφαρμογών Flatpak μπορεί να μην είναι δυνατή με το GNU Guix.</p>"
    }
  },
  "crystal_linux": {
    "distroName": "Crystal Linux",
    "introduction": "<0>Το Flatpak εγκαθίσταται από προεπιλογή στο Crystal Linux.</0> <p>Αν δεν χρησιμοποιήσατε το jade_gui για την εγκατάσταση του crystal ή επιλέξατε να μην το εγκαταστήσετε, μπορείτε να εγκαταστήσετε το Flatpak χρησιμοποιώντας τα παρακάτω βήματα.</p>",
    "step-2": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<p>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, εκτελέστε:</p> <2></2>"
    },
    "step-3": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>"
    },
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Για να εγκαταστήσετε το Flatpak στο Crystal Linux, πρέπει πρώτα να βεβαιωθείτε ότι τα πακέτα σας είναι ενημερωμένα. Εκτελέστε τα ακόλουθα σε ένα τερματικό:</p> <2></2> <p>Έπειτα εγκαταστήστε το Flatpak:</p> <6></6>"
    }
  },
  "vanilla_os": {
    "distroName": "Vanilla OS",
    "introduction": "<0>Το Flatpak είναι εγκατεστημένο από προεπιλογή στο λειτουργικό σύστημα Vanilla.</0> <2>Μπορείτε να χρησιμοποιήσετε την εφαρμογή Software ή να περιηγηθείτε στο <2>Flathub</2> για να εγκαταστήσετε εφαρμογές.</2> <p>Αν για κάποιο λόγο το Flathub δεν είναι διαθέσιμο, μπορείτε να το ρυθμίσετε χειροκίνητα χρησιμοποιώντας την ακόλουθη εντολή:</p> <6></6>"
  },
  "salix": {
    "distroName": "Salix",
    "introduction": "<0>Το Flatpak είναι εγκατεστημένο από προεπιλογή στο Salix από την έκδοση 15.0 - δεν απαιτείται εγκατάσταση!</0> <p> <p>Το Flatpak έρχεται προ-ρυθμισμένο με το αποθετήριο Flathub και περιλαμβάνονται εργαλεία ενσωμάτωσης στην επιφάνεια εργασίας για να επιτρέψουν την εγκατάσταση με 1 κλικ από το Flathub.</p> <4>Το μόνο που έχετε να κάνετε είναι <2>εγκατάσταση εφαρμογών</2>!</4>"
  }
}
