{
  "ubuntu": {
    "distroName": "Ubuntu",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<0>Για να εγκαταστήσετε το Flatpak σε <strong>Ubuntu 18.10 (Cosmic Cuttlefish) ή νεότερη έκδοση</strong>, ανοίξτε την εφαρμογή Terminal και εκτελέστε:</0> <2></2>"
    },
    "step-2": {
      "name": "Εγκατάσταση του πρόσθετου λογισμικού GNOME Flatpak",
      "text": "<p>Το πρόσθετο GNOME Software καθιστά δυνατή την εγκατάσταση εφαρμογών χωρίς να χρειάζεται η γραμμή εντολών. Για να το εγκαταστήσετε, εκτελέστε:</p> <2></2> <4><strong>Σημείωση:</strong> Το Ubuntu διανέμει το GNOME Software ως Snap στις εκδόσεις 20.04 έως 23.04 και το αντικατέστησε με το App Center στην 23.10 και νεότερες εκδόσεις - καμία από τις οποίες δεν υποστηρίζει την εγκατάσταση εφαρμογών Flatpak. Η εγκατάσταση του πρόσθετου Flatpak θα εγκαταστήσει επίσης μια deb έκδοση του Λογισμικού GNOME, με αποτέλεσμα να εγκατασταθούν ταυτόχρονα δύο εφαρμογές «Λογισμικό» στο Ubuntu 20.04 έως 23.04 και μια ενιαία νέα εφαρμογή «Λογισμικό» στο Ubuntu 23.10 και νεότερες.</4>"
    },
    "step-3": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<p>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, εκτελέστε:</p> <2></2>"
    },
    "step-4": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>"
    }
  },
  "fedora": {
    "distroName": "Fedora",
    "introduction": "<0>Το Flatpak είναι εγκατεστημένο από προεπιλογή στα Fedora Workstation, Fedora Silverblue και Fedora Kinoite. Για να ξεκινήσετε, το μόνο που χρειάζεται να κάνετε είναι να ενεργοποιήσετε το Flathub, το οποίο είναι ο καλύτερος τρόπος για να αποκτήσετε εφαρμογές Flatpak. Το Flathub είναι προ-ρυθμισμένο ως μέρος των <2>Third-Party Repositories</2>. Εναλλακτικά, μπορείτε να κατεβάσετε και να εγκαταστήσετε το <5>αρχείο αποθετηρίου Flathub</5>.</0> <2>Τώρα το μόνο που έχετε να κάνετε είναι <2>εγκατάσταση εφαρμογών</2>!</2> <p>Οι παραπάνω σύνδεσμοι θα πρέπει να λειτουργούν στις προεπιλεγμένες εγκαταστάσεις GNOME και KDE του Fedora, αλλά αν αποτύχουν για κάποιο λόγο, μπορείτε να προσθέσετε χειροκίνητα το απομακρυσμένο Flathub εκτελώντας:</p> <6></6>"
  },
  "manjaro": {
    "distroName": "Μαντζάρο",
    "step-1": {
      "name": "Ενεργοποίηση του Flatpak μέσω του Software Manager",
      "text": "<p>Το Flatpak εγκαθίσταται από προεπιλογή στο Manjaro 20 ή νεότερη έκδοση. </p> <2>Για να ενεργοποιήσετε την υποστήριξή του, πλοηγηθείτε στη <strong>Διαχείριση Λογισμικού</strong> (Προσθήκη/Αφαίρεση Προγραμμάτων)</2> <p> <p>Κάντε κλικ στο μενού με τις τρεις γραμμές [ή τις τελείες ανάλογα με το περιβάλλον επιφάνειας εργασίας] στα δεξιά, στο αναπτυσσόμενο μενού επιλέξτε «Προτιμήσεις»</p> <p>Πλοηγηθείτε στην καρτέλα «Flatpak» και σύρετε το διακόπτη στο Enable Flatpak support (είναι επίσης δυνατό να ενεργοποιήσετε τον έλεγχο για ενημερώσεις, κάτι που συνιστάται).</p>"
    },
    "step-2": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>"
    }
  },
  "endless_os": {
    "distroName": "Ατελείωτο OS",
    "introduction": "<0>Η υποστήριξη Flatpak είναι ενσωματωμένη στο Endless OS 3.0.0 και νεότερα - δεν απαιτείται εγκατάσταση!</0>"
  },
  "alt_linux": {
    "distroName": "ALT Linux",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Για να εγκαταστήσετε το Flatpak σε λειτουργικά συστήματα της οικογένειας Alt, ανοίξτε την εφαρμογή Terminal και εκτελέστε:</p> <2></2>"
    },
    "step-2": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<p>Το Flathub είναι ένα εξαιρετικό μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε στο σύστημα Alt, εκτελέστε:</p> <2></2>"
    },
    "step-3": {
      "name": "Επανεκκίνηση",
      "text": "<0>Επανεκκινήστε τη συσκευή σας για να ολοκληρώσετε την εγκατάσταση του Flatpak. Τώρα μπορείτε να <1>εγκαταστήσετε εφαρμογές</1>!</0>"
    }
  },
  "chrome_os": {
    "distroName": "ChromeOS",
    "introduction": "<0>Οι εφαρμογές Flatpak μπορούν να εγκατασταθούν στο ChromeOS με το επίπεδο συμβατότητας Crostini Linux. Αυτό δεν είναι διαθέσιμο για όλες τις συσκευές ChromeOS, οπότε θα πρέπει να βεβαιωθείτε ότι η συσκευή σας είναι συμβατή πριν προχωρήσετε. Ένας κατάλογος συμβατών συσκευών διατηρείται <2>εδώ</2>.</0>",
    "step-1": {
      "name": "Ενεργοποίηση υποστήριξης Linux",
      "text": "<0>Πλοηγηθείτε στο <2>chrome://os-settings</2> και μετακινηθείτε προς τα κάτω στο <strong>Developers</strong>. και ενεργοποιήστε το <i>Περιβάλλον ανάπτυξης Linux</i>. Το ChromeOS θα χρειαστεί λίγο χρόνο για να κατεβάσει και να εγκαταστήσει το Linux.</0>"
    },
    "step-2": {
      "name": "Ξεκινήστε ένα τερματικό Linux",
      "text": "<p>Πιέστε το πλήκτρο αναζήτησης/εκκίνησης, πληκτρολογήστε «Terminal» και εκκινήστε την εφαρμογή Terminal.</p>"
    },
    "step-3": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Για να εγκαταστήσετε το Flatpak, εκτελέστε τα ακόλουθα στο τερματικό:</p> <2></2>"
    },
    "step-4": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<p>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, εκτελέστε:</p> <2></2>"
    },
    "step-5": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το Linux. Μπορείτε να το κάνετε αυτό κάνοντας δεξί κλικ στο τερματικό και στη συνέχεια επιλέγοντας «Shut down Linux». Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>"
    }
  },
  "red_hat_enterprise_linux": {
    "distroName": "Red Hat Enterprise Linux",
    "introduction": "<0>Το Flatpak εγκαθίσταται από προεπιλογή στο Red Hat Enterprise Linux Workstation 9 και νεότερα. Για να ξεκινήσετε, το μόνο που χρειάζεται να κάνετε είναι να ενεργοποιήσετε το Flathub, το οποίο είναι ο καλύτερος τρόπος για να αποκτήσετε εφαρμογές Flatpak. Απλά κατεβάστε και εγκαταστήστε το αρχείο <2>Flathub repository</2>.</0> <p>Για να εγκαταστήσετε το Flatpak στο Red Hat Enterprise Linux Workstation 8 ή παλαιότερα, εκτελέστε τα ακόλουθα σε ένα τερματικό:</p> <5></5> <7>Τώρα το μόνο που έχετε να κάνετε είναι <2>εγκατάσταση εφαρμογών</2>!</7> <p>Οι παραπάνω σύνδεσμοι θα πρέπει να λειτουργούν στην προεπιλεγμένη εγκατάσταση του Red Hat Enterprise Linux Workstation 9, αλλά αν αποτύχουν για κάποιο λόγο, μπορείτε να προσθέσετε χειροκίνητα το απομακρυσμένο Flathub εκτελώντας:</p> <11></11>"
  },
  "linux_mint": {
    "distroName": "Linux Mint",
    "introduction": "<0>Η υποστήριξη Flatpak είναι ενσωματωμένη στο Linux Mint 18.3 και νεότερες εκδόσεις - δεν απαιτείται εγκατάσταση!</0>"
  },
  "opensuse": {
    "distroName": "openSUSE",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Το Flatpak είναι διαθέσιμο στα προεπιλεγμένα αποθετήρια όλων των εκδόσεων openSUSE Leap και openSUSE Tumbleweed που συντηρούνται επί του παρόντος.</p> <2>Αν προτιμάτε μια γραφική εγκατάσταση, μπορείτε να εγκαταστήσετε το Flatpak χρησιμοποιώντας ένα «πρόγραμμα εγκατάστασης με 1 κλικ» από το <2>software.opensuse.org</2>. Αν η έκδοση της διανομής σας δεν εμφανίζεται από προεπιλογή, κάντε κλικ στο <5>Εμφάνιση</5> στην κατηγορία Μη υποστηριζόμενες διανομές και στη συνέχεια επιλέξτε από τη λίστα.</2> <p>Εναλλακτικά, εγκαταστήστε το Flatpak από τη γραμμή εντολών χρησιμοποιώντας το Zypper:</p> <6></6>"
    },
    "step-2": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<p>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, εκτελέστε:</p> <2></2>"
    },
    "step-3": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>"
    }
  },
  "arch": {
    "distroName": "Arch",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Για να εγκαταστήσετε το Flatpak στο Arch, ανοίξτε την εφαρμογή Terminal και εκτελέστε:</p> <2></2>"
    },
    "step-2": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>"
    }
  },
  "debian": {
    "distroName": "Debian",
    "step-1": {
      "name": "Εγκαταστήστε το Flatpak",
      "text": "<p>Ένα πακέτο flatpak είναι διαθέσιμο στο Debian 10 (Buster) και νεότερα. Για να το εγκαταστήσετε, εκτελέστε τα ακόλουθα ως διαχειριστής συστήματος:</p> <2></2>"
    },
    "step-2": {
      "name": "Εγκαταστήστε το πρόσθετο Software Flatpak",
      "text": "<p>Αν χρησιμοποιείτε το GNOME, είναι επίσης καλή ιδέα να εγκαταστήσετε το πρόσθετο Flatpak για το λογισμικό GNOME. Για να το κάνετε αυτό, εκτελέστε:</p> <2></2> <p>Εάν εκτελείτε KDE, θα πρέπει αντ' αυτού να εγκαταστήσετε το backend Flatpak του Plasma Discover:</p> <6></6>"
    },
    "step-3": {
      "name": "Προσθέστε το αποθετήριο Flathub",
      "text": "<0>Το Flathub είναι το καλύτερο μέρος για να αποκτήσετε εφαρμογές Flatpak. Για να το ενεργοποιήσετε, κατεβάστε και εγκαταστήστε το αρχείο αποθετηρίου <2>Flathub</2> ή εκτελέστε τα ακόλουθα σε ένα τερματικό:</0> <2></2>"
    },
    "step-4": {
      "name": "Επανεκκίνηση",
      "text": "<0>Για να ολοκληρώσετε τη ρύθμιση, επανεκκινήστε το σύστημά σας. Τώρα το μόνο που έχετε να κάνετε είναι να <2>εγκαταστήσετε εφαρμογές</2>!</0>"
    }
  }
}
