{
  "ubuntu": {
    "step-1": {
      "name": "फ्लैटपैक संस्थापित करें",
      "text": "<text><strong>उबंटु १८.१० (Cosmic Cuttlefish - ब्रह्माण्डीय अर्णवज) या बाद के संस्करणों पर</strong> फ्लैटपैक संस्थापित करने के लिये, टर्मिनल ऐप खोलें और चलायें -</text> <code></code>"
    },
    "step-2": {
      "name": "नोम सॉफ्टवेयर फ्लैटपैक प्लगिन संस्थापित करें",
      "text": "<text>ग्नोम सॉफ्टवेयर संलग्नक बिना आज्ञा पटल का उपयोग किये ऐप संस्थापन संभव करता है। इसके संस्थापन के लिये, यह चलायें -</text> <code></code> <text><strong>सूचना -</strong> उबंटू २०.०४ से २३.०४ संस्करणों में ग्नोम सॉफ्टवेयर को एक स्नैप की तरह बाँटता है जबकि २३.१० और नये संस्करणों में इसकी जगह ऐप केंद्र का उपयोग करता है। दोनों ही फ्लैटपैक ऐपों के संस्थापन का समर्थन नहीं करते हैं। फ्लैटपैक संलग्नक के संस्थापन से ग्नोम सॉफ्टवेयर का डेब संस्करण भी संस्थापित होगा, जिससे उबंटू २०.०४ से २३.०४ पर एक ही समय में दो \"सॉफ्टवेयर\" ऐप संस्थापित हो जायेंगे जबकि २३.१० और नये उबंटू पर एक नया \"सॉफ्टवेयर\" ऐप संस्थापित हो जायेगा।</text>"
    },
    "distroName": "उबँटु",
    "step-4": {
      "name": "पुनरारंभ",
      "text": "<text>व्यवस्था पूर्ण करने के लिये अपने तंत्र को पुनरारंभ करें। अब आपको केवल <link>ऐप संस्थापन</link> करना है!</text>"
    },
    "step-3": {
      "name": "फ्लैटहब भंडार जोड़ें",
      "text": "<text>फ्लैटपैक ऐप पाने का सर्वश्रेष्ठ स्थान फ्लैटहब है। इसे सक्रिय करने के लिये, यह चलायें -</text> <code></code>"
    }
  },
  "fedora": {
    "distroName": "फेडोरा",
    "introduction": "<text>फेडोरा वर्कस्टेशन, फेडोरा सिल्वरब्लू, और फेडोरा कीनुयिट पर फ्लैटपैक पहले से संस्थापित होता है। फ्लैटपैक ऐप पाने के सबसे श्रेष्ठ तरीके - फ्लैटहब को बस सक्रिय करने की आवश्यकता है। फ्लैटहब पहले से ही <repolink>तृतीय-पक्ष भंडारों</repolink> के अंग की तरह विन्यासित है। वैकल्पिक तौर पर आप <filelink>फ्लैटहब भंडार फाइल</filelink> को डाउनलोड और संस्थापित कर सकते हैं।</text><text>अब आपको केवल <applink>ऐप संस्थापन</applink> करना है!</text><text>उपरोक्त लिंक स्वनिर्धारित GNOME और KDE फेडोरा संस्थापनों पर कार्य करना चाहिए, किंतु यदि वे किसी कारणवश असफल होते हैं तो आप यह चला कर स्वयं ही फ्लैटहब भंडार जोड़ सकते हैं -</text><code></code>"
  },
  "manjaro": {
    "distroName": "मंजारो",
    "step-1": {
      "name": "सॉफ्टवेयर प्रबंधक द्वारा फ्लैटपैक सक्रिय करें"
    }
  }
}
