{
  "endless_os": {
    "introduction": "<text>Flatpak desteği Endless OS 3.0.0 ve daha yeni sürümlerine entegre edilmiştir—kurulum gerekmez!</text>",
    "distroName": "Endless OS"
  },
  "ubuntu": {
    "step-4": {
      "name": "Yeniden başlat",
      "text": "<text>Kurulumu bitirmek için, sisteminizi yeniden önyükleyin. Artık tek yapmanız gereken <link>uygulamalar yüklemek</link>!</text>"
    },
    "step-1": {
      "name": "Flatpak'ı İndir",
      "text": "<text>Flatpak'ı <strong>Ubuntu 18.10 (Cosmic Cuttlefish) ve daha sonrasında</strong> yüklemek için, Terminal uygulamasını açın ve komutu çalıştırın:</text> <code></code>"
    },
    "step-2": {
      "name": "GNOME Yazılımı Flatpak eklentisini indirin",
      "text": "<text>GNOME Yazılımı eklentisi, komut satırına gerek duymadan uygulama yüklemenizi sağlar. İndirmek için bunu çalıştırın:</text> <code></code> <text><strong>Not:</strong> Ubuntu, GNOME Yazılımı'nı 20.04 sürümünden 23.04'e kadar Snap olarak dağıtmıştır, ayrıca 23.10 ve daha yeni sürümlerde Uygulama Merkezi ile değiştirmiştir —ki ikiside Flatpak uygulamaları yüklemeyi desteklemez. Flatpak eklentisini yüklemek aynı zamanda GNOME Yazılımı'nın deb halini yükler, bu, Ubuntu 20.04'ten 23.04'e kadar iki ve 23.10'dan sonrasında bir adet \"Yazılım\" uygulamalarının yüklenmesi ile sonuçlanacaktır.</text>"
    },
    "step-3": {
      "name": "Flathub deposunu ekle",
      "text": "<text>Flathub, Flatpak uygulamalarını yüklemek için en iyi yerdir. Aktifleştirmek için çalıştırın:</text> <code></code>"
    }
  },
  "fedora": {
    "distroName": "Fedora",
    "introduction": "<text>Flatpak, Fedora Workstation, Fedora Silverblue ve Fedora Kinoite sürümlerinde otomatik olarak yüklüdür. Başlamak için Flathub'u aktifleştirmelisiniz, ki bu Flatpak uygulamalarını almak için en iyi yoldur. Flathub, <repolink>Üçüncü Parti Depolar</repolink>'ın bir parçası olarak otomatik olarak ayarlanmıştır. Onun yerine, <filelink>Flathub depo dosyalarını</filelink> yükleyerek indirebilirsiniz.</text> <text>Şimdi tek yapmanız gereken <applink>uygulamalar yüklemek</applink>!</text> <text>Yukarıdaki bağlantılar varsayılan GNOME ve KDE Fedora sürümlerinde çalışmalıdır, olur da hata alırsanız elle Flathub uzak deposunu çalıştırmak için bu komutu girebilirsiniz:</text> <code></code>"
  },
  "manjaro": {
    "distroName": "Manjaro",
    "step-1": {
      "name": "Flatpak'ı Yazılım Yöneticisi ayrıcalığıyla etkinleştir"
    },
    "step-2": {
      "name": "Yeniden başlat",
      "text": "<text>Kurulumu bitirmek için, sisteminizi yeniden önyükleyin. Artık tek yapmanız gereken <link>uygulamalar yüklemek</link>!</text>"
    }
  },
  "alt_linux": {
    "distroName": "ALT Linux",
    "step-1": {
      "name": "Flatpak'ı yükle",
      "text": "<text>Flatpak'ı Alt ailesinin işletim sistemlerinde indirmek için Terminal uygulamasını açın ve çalıştırın:</text> <code></code>"
    },
    "step-2": {
      "name": "Flathub deposunu ekle"
    }
  }
}
