{
  "ubuntu": {
    "distroName": "Ubuntu",
    "step-1": {
      "name": "Установка Flatpak",
      "text": "<text>Чтобы установить Flatpak на <strong>Ubuntu 18.10 (Cosmic Cuttlefish) или поздней версии</strong>, откройте Терминал и выполните:</text> <code></code>"
    },
    "step-3": {
      "name": "Добавление репозитория Flathub",
      "text": "<text>Flathub - это лучшее место для получения приложений Flatpak. Чтобы включить, выполните:</text> <code></code>"
    },
    "step-4": {
      "name": "Перезагрузка",
      "text": "<text>Чтобы завершить установку, перезагрузите систему. Теперь, что вам нужно сделать - это <link>устанавливать приложения</link>!</text>"
    },
    "step-2": {
      "name": "Установка плагина Flatpak для Центра приложений GNOME",
      "text": "<text>Плагин для Центра приложений GNOME позволяет устанавливать приложения без использования терминала. Чтобы установить, выполните:</text> <code></code> <text><strong>Примечание:</strong> Ubuntu распространяет Центр приложений GNOME в формате Snap с версии 20.04 до 23.04, и был заменён на Центр приложений с 23.10 и новее, который не поддерживает Flatpak. Установка плагина Flatpak также установит deb версию Центра приложений GNOME, в результате чего будет два Центра приложений GNOME в Ubuntu 20.04 до 23.10, и одно приложение Центра приложений GNOME в Ubuntu 23.10 и новее.</text>"
    }
  },
  "fedora": {
    "distroName": "Fedora",
    "introduction": "<text>Flatpak установлен по умолчанию в Fedora Workstation, Fedora Silverblue и Fedora Kinoite. Чтобы начать, все что вам нужно - это включить Flathub, лучшее место для получения приложений Flatpak. Flathub уже настроен как <repolink>сторонний репозиторий</repolink>. Или же, вы можете скачать и установить <filelink>файл репозитория Flathub</filelink>.</text> <text>Теперь, все что вам нужно сделать - это <applink>устанавливать приложения</applink>!</text> <text>Предоставленные выше ссылки должны работать на GNOME по умолчанию и установках KDE Fedora, но если они не работают по какой-либо причине, вы можете добавить Flathub, выполнив:</text> <code></code>"
  },
  "manjaro": {
    "distroName": "Manjaro",
    "step-2": {
      "name": "Перезагрузка",
      "text": "<text>Чтобы завершить установку, перезагрузите систему. Теперь, все что вам нужно сделать - это <link>устанавливать приложения</link>!</text>"
    },
    "step-1": {
      "name": "Включение Flatpak в менеджере программного обеспечения",
      "text": "<text>Flatpak установлен по умолчанию на Manjaro 20 или выше.</text> <text>Чтобы включить поддержку, направитесь в <strong>Менеджер ПО</strong> (Установка/удаление программ)</text> <text>Нажмите на трехстрочное меню [или точки в зависимости от среды рабочего стола] справа, в выпадающем меню выберите \"Параметры\".</text> <text>Направитесь на вкладку \"Flatpak\" и передвиньте ползунок, чтобы включить поддержку Flatpak (также возможно включить проверку обновлений, что рекомендуется сделать).</text>"
    }
  },
  "endless_os": {
    "distroName": "Endless OS",
    "introduction": "<text>Поддержка Flatpak встроена в Endless OS 3.0.0 и выше—установка не требуется!</text>"
  },
  "alt_linux": {
    "distroName": "Альт Линукс",
    "step-3": {
      "name": "Перезагрузка",
      "text": "<text>Перезапустите ПК для завершения установки Flatpak. Теперь вы можете <link>установить приложения</link>!</text>"
    },
    "step-1": {
      "name": "Установка Flatpak",
      "text": "<text>Чтобы установить Flatpak на ОС семейства Alt Linux, откройте Терминал и выполните:</text> <code></code>"
    },
    "step-2": {
      "name": "Добавление репозитория Flathub",
      "text": "<text>Flathub - это лучшее место для получения приложений Flatpak. Чтобы включить его на ОС Alt Linux, выполните:</text> <code></code>"
    }
  },
  "chrome_os": {
    "distroName": "ChromeOS",
    "step-2": {
      "name": "Запуск терминала на Linux",
      "text": "<text>Нажмите клавишу поиска / запуска, введите \"Терминал\" и запустите приложение терминала.</text>"
    },
    "step-5": {
      "name": "Перезагрузка",
      "text": "<text>Для завершения установки перезапустите Linux. Вы можете сделать это, щелкнув правой кнопкой мыши терминал, а затем нажав \"Завершить работу Linux\". Теперь все, что вам нужно сделать, это <link>устанавливать приложения</link>!</text>"
    },
    "step-3": {
      "name": "Установка Flatpak",
      "text": "<text>Чтобы установить Flatpak, выполните следующую команду в терминале:</text> <code></code>"
    },
    "step-4": {
      "name": "Добавление репозитория Flathub",
      "text": "<text>Flathub - это лучшее место для получения приложений Flatpak. Чтобы его включит, выполните:</text> <code></code>"
    },
    "step-1": {
      "name": "Включение поддержки Linux",
      "text": "<text>Направитесь в <settingslink>chrome://os-settings</settingslink>, и спуститесь до настроек <strong>для разработчиков</strong> и включите <em>среду разработки Linux</em>. ChromeOS потребуется некоторое время для скачивания и установки Linux.</text>"
    },
    "introduction": "<text>Приложения Flatpak могут быть установлены на ChromeOS с помощью слоя совместимости Crostini Linux. Это доступно не для всех устройств ChromeOS, поэтому прежде чем приступить к работе, убедитесь, что ваше устройство совместимо. Список совместимых устройств находится <link>здесь</link>.</text>"
  },
  "red_hat_enterprise_linux": {
    "distroName": "Red Hat Enterprise Linux",
    "introduction": "<text>Flatpak установлен по умолчанию на Red Hat Enterprise Linux Workstation 9 и новее. Для начала все, что вам нужно сделать, это включить Flathub, который является лучшим способом получения приложений Flatpak. Просто скачайте и установите <filelink>файл репозитория Flathub</filelink>.</text> <text>Чтобы установить Flatpak на рабочую станцию Red Hat Enterprise Linux 8 или более поздней версии, выполните следующую команду в терминале:</text>  <code></code> <text> Теперь все, что вам нужно сделать - это <link>устанавливать приложения</link>!</text> <text>Приведенные выше ссылки должны работать на Red Hat Enterprise Linux Workstation 9 по умолчанию, но если по какой-либо причине они не работают, вы можете вручную добавить репозиторий Flathub, выполнив команду:</text> <codeAddRemote></codeAddRemote>"
  },
  "linux_mint": {
    "distroName": "Linux Mint",
    "introduction": "<text>Поддержка Flatpak встроена в Linux Mint 18.3 или выше—установка не требуется!</text>"
  },
  "opensuse": {
    "distroName": "openSUSE",
    "step-1": {
      "name": "Установка Flatpak",
      "text": "<text>Flatpak доступен в репозиториях по умолчанию всех поддерживаемых в настоящее время версий openSUSE Leap и openSUSE Tumbleweed.</text> <text>Если вы предпочитаете графическую установку, вы можете установить Flatpak с помощью \"установщика в 1 клик\" из <link>software.opensuse.org</link>. Если версия вашего дистрибутива не отображается по умолчанию, нажмите <em>Показать</em> в разделе категория Неподдерживаемых дистрибутивов и затем выберите из списка.</text> <text>Или же, можно установить Flatpak из терминала с помощью Zypper:</text> <code></code>"
    },
    "step-3": {
      "name": "Перезагрузка",
      "text": "<text>Для завершения установки перезапустите систему. Теперь все, что вам нужно сделать - это <link>установить приложения</link>!</text>"
    },
    "step-2": {
      "name": "Добавление репозитория Flathub",
      "text": "<text>Flathub - лучшее место для получения приложений Flatpak. Чтобы включить его, выполните:</text> <code></code>"
    }
  },
  "arch": {
    "distroName": "Arch",
    "step-2": {
      "name": "Перезагрузка",
      "text": "<text>Чтобы завершить установку, перезагрузите систему. Теперь, все что вам нужно - это <link>установить приложения</link>!</text>"
    },
    "step-1": {
      "name": "Установка Flatpak",
      "text": "<text>Чтобы установить Flatpak на Arch, откройте Терминал и выполните:</text> <code></code>"
    }
  },
  "debian": {
    "distroName": "Debian",
    "step-1": {
      "name": "Установка Flatpak",
      "text": "<text>Пакет flatpak доступен в Debian 10 (Buster) и выше. Чтобы его установить, выполните данную команду от имени root:</text> <code></code>"
    },
    "step-3": {
      "name": "Добавление репозитория Flathub",
      "text": "<text>Flathub - это лучшее место для установки приложений Flatpak. Чтобы его включить, скачайте и установите <filelink>файл репозитория Flathub</filelink> или выполните эту команду в терминале:</text> <code></code>"
    },
    "step-4": {
      "name": "Перезагрузка",
      "text": "<text>Чтобы завершить установку, перезагрузите систему. Теперь, все что вам нужно сделать - это <link>установить приложения</link>!</text>"
    },
    "step-2": {
      "name": "Установка плагина Flatpak для Software",
      "text": "<text>Если вы используете GNOME, то хорошая идея установить плагин Flatpak для Центра приложений GNOME. Чтобы это сделать, выполните:</text> <code></code> <text>Если вы используете KDE, то вместо этого вам следует установить бэкэнд Plasma Discover Flatpak:</text> <codeDiscover></codeDiscover>"
    }
  },
  "rocky_linux": {
    "distroName": "Rocky Linux",
    "step-1": {
      "name": "Установка Flatpak",
      "text": "<text>Flatpak устанавливается по умолчанию в Rocky Linux 8 и новее, при установке с выбранным программным обеспечением, включающим GNOME (сервер с графическим интерфейсом, рабочая станция). Если вы используете такую систему, вы можете пропустить этот шаг. Чтобы установить Flatpak в Rocky Linux, запустите следующую команду в терминале: </text> <code></code>"
    },
    "step-2": {
      "name": "Добавление репозитория Flathub",
      "text": "<text>Flathub - лучшее место для получения приложений Flatpak. Чтобы включить его, загрузите и установите <filelink>файл репозитория Flathub</filelink> или выполните следующее в терминале:</text> <code></code>"
    },
    "step-3": {
      "name": "Перезагрузка",
      "text": "<text>Для завершения установки перезапустите систему. Теперь все, что вам нужно сделать - это <link>установить приложения</link>!</text>"
    }
  },
  "centos": {
    "distroName": "CentOS Stream",
    "introduction": "<text>Flatpak устанавливается по умолчанию в CentOS Stream 8 и новее при использовании GNOME. Чтобы начать, все, что вам нужно сделать, это включить Flathub, который является лучшим способом получения приложений Flatpak. Просто скачайте и установите <filelink>файл репозитория Flathub</filelink>.</text> <text>Теперь все, что вам нужно сделать - это <link>установить приложения</link>!</text>"
  },
  "almalinux": {
    "distroName": "AlmaLinux",
    "introduction": "<text>Flatpak установлен по умолчанию в AlmaLinux 8 и новее при использовании GNOME. Чтобы начать работу, достаточно включить Flathub, который является лучшим способом получения приложений Flatpak. Просто скачайте и установите <filelink>Файл репозитория Flathub</filelink>.</text> <text> Теперь вам остается только <link>установить приложения</link>!</text>"
  },
  "gentoo": {
    "distroName": "Gentoo",
    "step-2": {
      "name": "Добавление репозитория Flathub",
      "text": "<text>Flathub - это лучшее место для загрузки приложений Flatpak. Чтобы включить его, выполните команду:</text> <code></code>"
    },
    "step-3": {
      "name": "Перезагрузка",
      "text": "<text>Для завершения установки перезагрузите систему. Теперь вам осталось только <link>установить приложения</link>!</text> <text>Примечание: графическая установка приложений Flatpak может быть невозможна в Gentoo.</text>"
    },
    "step-1": {
      "name": "Установка Flatpak",
      "text": "<text>Чтобы установить Flatpak на Gentoo, откройте Терминал и выполните команду:</text> <code></code>"
    }
  },
  "kubuntu": {
    "distroName": "Kubuntu",
    "step-4": {
      "name": "Перезагрузка",
      "text": "<text>Для завершения установки перезагрузите систему. Теперь вам осталось только <link> установить приложения</link>! </text>"
    },
    "step-1": {
      "name": "Установка Flatpak",
      "text": "<text>Чтобы установить Flatpak на Kubuntu, откройте Discover, перейдите в раздел «Настройка», установите бэкенд Flatpak и перезапустите Discover.</text>"
    },
    "step-3": {
      "name": "Добавление репозитория Flathub",
      "text": "<text>Flathub - лучшее место для загрузки приложений Flatpak. Чтобы включить его, откройте Discover, перейдите в раздел «Настройка» и добавьте репозиторий Flathub.</text>"
    },
    "step-2": {
      "name": "Установка модуля параметров системы для управления Flatpak",
      "text": "<text>Чтобы интегрировать поддержку Flatpak в системные настройки Plasma, откройте Терминал и выполните команду:</text> <code></code>"
    }
  },
  "solus": {
    "distroName": "Solus",
    "step-2": {
      "name": "Добавление репозитория Flathub",
      "text": "<text>Flathub - лучшее место для загрузки приложений Flatpak. Чтобы включить его, скачайте и установите <filelink>Файл репозитория Flathub</filelink> или выполните следующие команды в терминале:</text> <code></code>"
    },
    "step-3": {
      "name": "Перезагрузка",
      "text": "<text>Для завершения установки перезагрузите систему. Теперь вам осталось только <link>установить приложения</link>!</text> <text>Примечание: графическая установка приложений Flatpak доступна только через GNOME Software и/или KDE Discover.</text>"
    },
    "step-1": {
      "name": "Установка Flatpak",
      "text": "<text>Чтобы установить Flatpak на Solus, откройте Терминал и выполните команду:</text> <code></code>"
    },
    "introduction": "<text>Поддержка Flatpak встроена в Solus 4.7 и более новые версии - установка не требуется! Приложения Flatpak можно установить с помощью GNOME Software и/или KDE Discover.</text> <text> Если Flatpak не установлен, следуйте инструкциям ниже, чтобы начать работу.</text>"
  },
  "alpine": {
    "distroName": "Alpine",
    "step-4": {
      "name": "Перезагрузка",
      "text": "<text>Для завершения установки, перезапустите систему. Теперь, пришло время <link>устанавливать приложения</link>!</text>"
    },
    "step-1": {
      "name": "Установка Flatpak",
      "text": "<text>Flatpak можно установить из репозитория сообщества. Выполните следующие команды в терминале:</text> <code></code>"
    },
    "step-3": {
      "name": "Добавление репозитория Flathub",
      "text": "<text>Flathub — лучшее место для получения Flatpak приложений. Чтобы его включить, скачайте и установите <filelink>файл репозитория Flathub</filelink> или выполните следующие команды в терминале:</text> <code></code>"
    },
    "step-2": {
      "name": "Установка плагина Flatpak для Software",
      "text": "<text>Вы можете установить плагин Flatpak для Центра Приложений GNOME (с версии 3.13) или KDE Discover (с версии 3.11), что позволит устанавливать приложения без необходимости использовать командную строку. Чтобы установить, для Центра Приложений GNOME выполните:</text> <code></code> <text>Для KDE Discover выполните:</text> <codeDiscover></codeDiscover>"
    }
  },
  "mageia": {
    "distroName": "Mageia",
    "step-3": {
      "name": "Перезагрузка",
      "text": "<text>Чтобы завершить настройку, перезагрузите систему. Теперь все, что вам нужно сделать, это <link>установить приложения</link>!</text> <text>Примечание: графическая установка приложений Flatpak может быть невозможна в Mageia.</text>"
    },
    "step-1": {
      "name": "Установка Flatpak",
      "text": "<text>Пакет flatpak доступен для Mageia 6 и более поздних версий. Для установки с помощью DNF выполните следующую команду от имени root:</text> <code></code> <text>Или, для установки с помощью <strong>urpmi</strong>, выполните:</text> <codeUrpmi></codeUrpmi>"
    },
    "step-2": {
      "name": "Добавление репозитория Flathub",
      "text": "<text>Flathub — лучшее место для получения приложений Flatpak. Чтобы включить его, загрузите и установите <filelink>файл репозитория Flathub</filelink> или выполните следующую команду в терминале:</text> <code></code>"
    }
  },
  "openmandriva_lx": {
    "distroName": "OpenMandriva Lx",
    "introduction": "<header>Поддержка Flatpak встроена в OpenMandriva для всех активно поддерживаемых версий, начиная со стабильной версии \"Rock 5.0\", версии для разработчиков \"Cooker\" и заканчивая текущей версией \"ROME\".</header> <text>Flatpak поставляется с предварительно настроенным Flathub репозиторием.</text>"
  },
  "pop_os": {
    "distroName": "Pop!_OS",
    "introduction": "<text>Поддержка Flatpak встроена в Pop!_O 20.04 и новее — настройки не требуется!</text>"
  },
  "elementary_os": {
    "distroName": "elementary OS",
    "step-1": {
      "name": "Установить приложения"
    }
  },
  "raspberry_pi_os": {
    "distroName": "Raspberry Pi OS",
    "step-3": {
      "name": "Перезагрузка"
    },
    "step-1": {
      "name": "Установка Flatpak"
    },
    "step-2": {
      "name": "Добавление репозитория Flathub"
    }
  },
  "void_linux": {
    "distroName": "Void Linux",
    "step-3": {
      "name": "Перезагрузка"
    },
    "step-1": {
      "name": "Установка Flatpak"
    },
    "step-2": {
      "name": "Добавление репозитория Flathub"
    }
  },
  "nixos": {
    "distroName": "NixOS",
    "step-1": {
      "name": "Установка Flatpak"
    },
    "step-2": {
      "name": "Добавление репозитория Flathub"
    },
    "step-3": {
      "name": "Перезагрузка"
    }
  },
  "pureos": {
    "distroName": "PureOS"
  },
  "zorin_os": {
    "distroName": "Zorin OS"
  },
  "deepin": {
    "distroName": "Deepin",
    "step-1": {
      "name": "Установка Flatpak"
    },
    "step-2": {
      "name": "Добавление репозитория Flathub"
    },
    "step-4": {
      "name": "Перезагрузка"
    },
    "step-3": {
      "name": "Установка тем Deepin",
      "text": "<text>Для установки светлых и тёмных тем, выполните:</text> <code></code>"
    }
  },
  "pardus": {
    "distroName": "Pardus",
    "step-1": {
      "name": "Установка Flatpak"
    },
    "step-4": {
      "name": "Перезагрузка"
    },
    "step-3": {
      "name": "Добавление репозитория Flathub"
    },
    "step-2": {
      "name": "Установка плагина Flatpak для Software"
    }
  },
  "mx_linux": {
    "distroName": "MX Linux",
    "step-1": {
      "name": "Включение Flatpak в менеджере программного обеспечения"
    },
    "step-2": {
      "name": "Перезагрузка"
    }
  },
  "pisi_gnulinux": {
    "distroName": "Pisi GNU/Linux",
    "step-2": {
      "name": "Добавление репозитория Flathub"
    },
    "step-3": {
      "name": "Перезагрузка"
    },
    "step-1": {
      "name": "Установка Flatpak"
    }
  },
  "endeavouros": {
    "distroName": "EndeavourOS",
    "step-1": {
      "name": "Установка Flatpak"
    },
    "step-2": {
      "name": "Добавление репозитория Flathub"
    },
    "step-3": {
      "name": "Перезагрузка"
    }
  },
  "kde_neon": {
    "distroName": "KDE neon"
  },
  "gnu_guix": {
    "distroName": "GNU Guix",
    "step-3": {
      "name": "Перезагрузка"
    },
    "step-1": {
      "name": "Установка Flatpak"
    },
    "step-2": {
      "name": "Добавление репозитория Flathub"
    }
  },
  "crystal_linux": {
    "distroName": "Crystal Linux",
    "step-2": {
      "name": "Добавление репозитория Flathub"
    },
    "step-3": {
      "name": "Перезагрузка"
    },
    "step-1": {
      "name": "Установка Flatpak"
    }
  },
  "vanilla_os": {
    "distroName": "Vanilla OS"
  },
  "salix": {
    "distroName": "Salix"
  }
}
